Original_Source_Code/FGMFoam/03_testcase.org/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         reactingMixture;
    transport       sutherland;
    thermo          janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}


inertSpecie N2;

chemistryReader chemkinReader;

CHEMKINFile "$FOAM_CASE/chemkin/reactions.inp";

CHEMKINThermoFile "$FOAM_CASE/chemkin/therm.dat";

CHEMKINTransportFile "$FOAM_CASE/chemkin/transportProperties";


// ************************************************************************* //
