Original_Source_Code/FGMFoam/03_testcase.org/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     FGMFoam;

startFrom       latestTime;

startTime       0;

stopAt          writeNow;//endTime;

endTime         0.1;

deltaT          5e-5;

writeControl    adjustableRunTime;

writeInterval   10000e-5;

purgeWrite     10;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   7;

runTimeModifiable true;

adjustTimeStep    off;

maxCo           0.1;


// ************************************************************************* //
